#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_web_app.this must be replaced
-/+ resource "azurerm_linux_web_app" "this" {
      - app_settings                                   = {} -> null
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "app-frontend-prod-uksouth-80ad7f83.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-frontend-prod-uksouth-80ad7f83/providers/Microsoft.Web/sites/app-frontend-prod-uksouth-80ad7f83" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux,container" -> (known after apply)
      ~ name                                           = "app-frontend-prod-uksouth-80ad7f83" -> "app-frontend-sbx-uksouth-80ad7f83" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "4.158.234.106",
          - "4.158.73.169",
          - "4.158.37.174",
          - "4.158.73.237",
          - "4.159.0.70",
          - "4.234.26.14",
          - "20.90.133.0",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "4.158.234.106,4.158.73.169,4.158.37.174,4.158.73.237,4.159.0.70,4.234.26.14,20.90.133.0" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "85.210.72.243",
          - "4.158.91.189",
          - "85.210.16.175",
          - "52.151.106.227",
          - "85.210.50.255",
          - "4.158.112.157",
          - "85.210.89.0",
          - "52.151.106.68",
          - "52.151.106.89",
          - "4.158.33.95",
          - "20.162.131.212",
          - "4.158.137.76",
          - "52.151.104.201",
          - "4.158.73.85",
          - "4.158.91.164",
          - "4.158.80.20",
          - "51.142.216.244",
          - "172.166.95.99",
          - "4.158.234.106",
          - "4.158.73.169",
          - "4.158.37.174",
          - "4.158.73.237",
          - "4.159.0.70",
          - "4.234.26.14",
          - "85.210.72.243",
          - "4.158.91.189",
          - "85.210.16.175",
          - "52.151.106.227",
          - "85.210.50.255",
          - "4.158.112.157",
          - "51.142.217.200",
          - "172.166.95.184",
          - "4.158.70.89",
          - "4.158.24.135",
          - "4.158.108.81",
          - "4.234.27.138",
          - "20.90.133.0",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "85.210.72.243,4.158.91.189,85.210.16.175,52.151.106.227,85.210.50.255,4.158.112.157,85.210.89.0,52.151.106.68,52.151.106.89,4.158.33.95,20.162.131.212,4.158.137.76,52.151.104.201,4.158.73.85,4.158.91.164,4.158.80.20,51.142.216.244,172.166.95.99,4.158.234.106,4.158.73.169,4.158.37.174,4.158.73.237,4.159.0.70,4.234.26.14,85.210.72.243,4.158.91.189,85.210.16.175,52.151.106.227,85.210.50.255,4.158.112.157,51.142.217.200,172.166.95.184,4.158.70.89,4.158.24.135,4.158.108.81,4.234.27.138,20.90.133.0" -> (known after apply)
      ~ resource_group_name                            = "rg-frontend-prod-uksouth-80ad7f83" -> "rg-frontend-sbx-uksouth-80ad7f83" # forces replacement
      ~ service_plan_id                                = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-frontend-prod-uksouth-80ad7f83/providers/Microsoft.Web/serverFarms/plan-frontend-prod-uksouth-80ad7f83" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      ~ tags                                           = {
          ~ "environment" = "prod" -> "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Frontend App"
        }
      + zip_deploy_file                                = (known after apply)
        # (11 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                             = false -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ health_check_eviction_time_in_min             = 0 -> (known after apply)
          ~ linux_fx_version                              = "DOCKER|index.docker.io/frontend" -> (known after apply)
          ~ remote_debugging_version                      = "VS2022" -> (known after apply)
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (21 unchanged attributes hidden)

          ~ application_stack {
              ~ docker_image_name        = "frontend" -> "heathen1878/demo:"
              + docker_registry_password = (sensitive value)
              + docker_registry_username = (known after apply)
                # (12 unchanged attributes hidden)
            }
        }
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id         = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-frontend-prod-uksouth-80ad7f83" -> (known after apply)
      ~ name       = "rg-frontend-prod-uksouth-80ad7f83" -> "rg-frontend-sbx-uksouth-80ad7f83" # forces replacement
      ~ tags       = {
          ~ "environment" = "prod" -> "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Frontend App"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-frontend-prod-uksouth-80ad7f83/providers/Microsoft.Web/serverFarms/plan-frontend-prod-uksouth-80ad7f83" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "plan-frontend-prod-uksouth-80ad7f83" -> "plan-frontend-sbx-uksouth-80ad7f83" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "rg-frontend-prod-uksouth-80ad7f83" -> "rg-frontend-sbx-uksouth-80ad7f83" # forces replacement
      ~ tags                         = {
          ~ "environment" = "prod" -> "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Frontend App"
        }
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Infrastructure